Document/Manual/CategoryAndToken.org
# -*- Mode: org ; Coding: utf-8-unix -*-
j#+TITLE: ecalj : Category and token in ctrl file
#+AUTHOR: takao kotani @ tottori university, Japan
#+email: takaokotani@gmail.com

Currently, ctrl file have nested structure.

* SPEC
** ATOM
    a few-character string that labels the atom of that
    species.  This string names the disk file that will
    hold information about that atom (potential
    parameters, moments, potential and some sundry other
    information), and is used elsewhere in the input (see
    categories SITE and START below) to identify a
    particular atom.  Note: species are split into
    classes, and so the program differentiates names by
    appending integers to the label for species with
    multiple classes.
Under each ATOM=XXX, we set following subtokens.
*** Z=       
nuclear charge. We can use fractional number
*** R=
the sphere radius, in atomic units (Bohr)
*** NR=,A=
defines the radial mesh, together with R, on which
           densities and potentials are tabulated with MT sphere
           It is a shifted logarithmic radial mesh of points
           const*exp(A*(0..NR-1)-1).
*** LMX= 
basis l-cutoff inside the sphere.  If not specified,
           it defaults to NL-1.
*** IDMOD=   (special option)
a set of integers, one for each l-channel controlling
           how the potential parameter enu changes from
           one iteration to the next in a self-consistency cycle.
           0:  lets the enu shift to the center of gravity
              of the occupied part of the band (this is the default);
           1:  freezes the logarithmic derivative of the
              wave function phi at the sphere radius from one iteration
              to the next;
           2:  freezes the enu's from one iteration to the next.
*** IDU=, UH=, JH=
pecify parameters for LDA+U.  IDU=#,#,#,... specifies which
          l-channels are to have U and the type of LDA+U implementation.
          0 in a particular l-channel means no U is to be applied
          1,2,3 are for particular forms of LDA+U.  However,
          at present the ASA code does not have a proper implementation of LDA+U;
          instead potential parameters C and enu may be shifted by a constant.
          Use IDU=4 to shift both spin channels by a constant (specified by U)
          or  IDU=5 to shift majority channel by U and minority by J.
          Example:
             IDU= 0 0 0 5 UH= 0 0 0 -0.28    JH=0 0 0 0.23
          shifts the majority f channel by -0.28 Ry and the minority f channel
          by 0.23 Ry.  This mimics an LDA+U calculation for Gd.

*** P=real,real,....
Starting values for potential functions, one for each of l=0..LMXA (real numbers for s,p,d,f
Default: taken from an internal table.---> See by 'lmfa si|grep conf' for ctrl.si.
*** PZ= real,real,...
Starting values for local orbital's potential functions, one for each of l=0..LMX. Setting PZ=0 for any l means that no local orbital is specified for this l. Each integer part of PZ must be either one less than P (semicore state) or one greater (high-lying state).
Default: zero.

*** Q= real,real,...
charges for each l-channel making up free-atom density
Default: taken from an internal table.
*** MMOM=real,real,...
magnetic moments for each l-channel making up free-atom density Relevant only for the spin-polarized case.
Default: 0,0,... 
*** LFOCA
prescribes how core is treated.
    0 confines core to within RMT. Usually the least accurate. 
    1 treats the core as frozen but lets it spill into the interstitial 
    2 same as 1, but interstitial contribution to vxc treated perturbatively. 
Default: 1 
*** LMXA
angular momentum l-cutoff for projection of wave functions tails centered at other sites in this sphere. Must be at least the basis l-cutoff (specified by LMX=).
Default:NL-1.
LMXA should be the same for all sites for QSGW (2019,because of implementation problem).

*** C-HOLE
channel for core hole. You can force partial core occupation. Syntax consists of two characters, the principal quantum number and the second one of `s',`d',`d',`f' for the l quantum number, e.g. `2s' See Partially occupied core holes for description and examples.
Default: nothing 
*** C-HQ= real[,real]
First number specifies the number of electrons to remove from the l channel specified by C-HOLE=.
Second (optional) number specifies the hole magnetic moment.
See Partially occupied core holes for description and examples. 

