Document/Manual/CategoryAndToken.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-09 月 18:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ecalj : Category and token in ctrl file</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="takao kotani @ tottori university, Japan" />
</head>
<body>
<div id="content">
<h1 class="title">ecalj : Category and token in ctrl file</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org60329ad">1. SPEC</a>
<ul>
<li><a href="#org8c67272">1.1. ATOM</a>
<ul>
<li><a href="#org79dc1b9">1.1.1. Z=</a></li>
<li><a href="#org06249c5">1.1.2. R=</a></li>
<li><a href="#org24e29a0">1.1.3. NR=,A=</a></li>
<li><a href="#orga4d0a48">1.1.4. LMX=</a></li>
<li><a href="#org618579b">1.1.5. IDMOD=   (special option)</a></li>
<li><a href="#org4bb156d">1.1.6. IDU=, UH=, JH=</a></li>
<li><a href="#orgcfdd85e">1.1.7. P=real,real,&#x2026;.</a></li>
<li><a href="#org8a658df">1.1.8. PZ= real,real,&#x2026;</a></li>
<li><a href="#org1e43458">1.1.9. Q= real,real,&#x2026;</a></li>
<li><a href="#org5c05486">1.1.10. MMOM=real,real,&#x2026;</a></li>
<li><a href="#orgd7c75be">1.1.11. LFOCA</a></li>
<li><a href="#org3002341">1.1.12. LMXA</a></li>
<li><a href="#org6be9f26">1.1.13. C-HOLE</a></li>
<li><a href="#org4c2fff7">1.1.14. C-HQ= real[,real]</a></li>
<li><a href="#orga4a596e">1.1.15. KMXA</a></li>
<li><a href="#orgdef3203">1.1.16. RSMA</a></li>
<li><a href="#org483424c">1.1.17. RSMG</a></li>
<li><a href="#orgece06c4">1.1.18. LMXL (obsolate?)</a></li>
<li><a href="#org65eb810">1.1.19. RFOCA</a></li>
<li><a href="#orge6e72d3">1.1.20. RSMFA</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org369364d">2. SYMGRP</a></li>
<li><a href="#org10e2aeb">3. BZ</a>
<ul>
<li><a href="#org2e99a55">3.1. NKABC=  (1-3 integers)</a></li>
<li><a href="#orga12204e">3.2. TETRA=</a></li>
<li><a href="#org3126538">3.3. SAVDOS=</a></li>
<li><a href="#orgd90ce1e">3.4. NPT=   number of points in the density-of-states mesh used in</a></li>
<li><a href="#orgd8bb590">3.5. DOS=    (two numbers) Energy window over which DOS accumulated.</a></li>
<li><a href="#org9784a79">3.6. METAL= 4</a></li>
<li><a href="#org043ccce">3.7. NEVMX=  nevmx&gt;0 : Find at most nevmx eigenvectors;</a></li>
<li><a href="#org492df97">3.8. ZVAL=   Number of electrons to accumulate in BZ integration.</a></li>
<li><a href="#orgec12d27">3.9. NOINV=  suppress the automatic addition of the inversion to the</a></li>
<li><a href="#org6beb190">3.10. FSMOM=  set the global magnetic moment (collinear magnetic case).</a></li>
<li><a href="#org9cd419e">3.11. INVIT=  enables inverse iteration generate eigenvectors (this is</a></li>
</ul>
</li>
<li><a href="#org494b81a">4. EWALD</a>
<ul>
<li><a href="#org011f119">4.1. NKDMX=  the maximum number of real-space lattice vectors</a></li>
<li><a href="#org196ba11">4.2. AS=     controls the relative number of lattice vectors in real</a></li>
<li><a href="#org91dcdb1">4.3. TOL=    error criterion for the Ewald sums.</a></li>
</ul>
</li>
<li><a href="#org35addb1">5. HAM</a>
<ul>
<li><a href="#org9385b65">5.1. GMAX</a></li>
<li><a href="#org598e5e8">5.2. FTMESH</a></li>
<li><a href="#org3bc7ec8">5.3. TOL</a></li>
<li><a href="#orga3c125e">5.4. FRZWF (=T or F)</a></li>
<li><a href="#orgf27ea60">5.5. FORCES (=0 or 1)</a></li>
<li><a href="#org9dd1436">5.6. ELIND (Default=-1)</a></li>
</ul>
</li>
<li><a href="#orga802d8c">6. ITERa</a>
<ul>
<li><a href="#org29ee64e">6.1. MIX</a></li>
<li><a href="#org7d596c2">6.2. CONV</a></li>
<li><a href="#org326bd56">6.3. CONVC</a></li>
<li><a href="#org87a3b4a">6.4. NIT</a></li>
</ul>
</li>
<li><a href="#org33ea36d">7. DYN</a>
<ul>
<li><a href="#orgcbde9f3">7.1. MSTAT</a></li>
<li><a href="#orgff8f765">7.2. NIT</a></li>
</ul>
</li>
<li><a href="#orgb108822">8. STRUC</a></li>
</ul>
</div>
</div>
<p>
Currently, ctrl file have nested structure.
</p>

<div id="outline-container-org60329ad" class="outline-2">
<h2 id="org60329ad"><span class="section-number-2">1</span> SPEC</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8c67272" class="outline-3">
<h3 id="org8c67272"><span class="section-number-3">1.1</span> ATOM</h3>
<div class="outline-text-3" id="text-1-1">
<p>
a few-character string that labels the atom of that
species.  This string names the disk file that will
hold information about that atom (potential
parameters, moments, potential and some sundry other
information), and is used elsewhere in the input (see
categories SITE and START below) to identify a
particular atom.  Note: species are split into
classes, and so the program differentiates names by
appending integers to the label for species with
multiple classes.
</p>

<p>
Under each ATOM=XXX, we set following subtokens.
</p>
</div>
<div id="outline-container-org79dc1b9" class="outline-4">
<h4 id="org79dc1b9"><span class="section-number-4">1.1.1</span> Z=</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
nuclear charge. We can use fractional number
</p>
</div>
</div>
<div id="outline-container-org06249c5" class="outline-4">
<h4 id="org06249c5"><span class="section-number-4">1.1.2</span> R=</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
the sphere radius, in atomic units (Bohr)
</p>
</div>
</div>
<div id="outline-container-org24e29a0" class="outline-4">
<h4 id="org24e29a0"><span class="section-number-4">1.1.3</span> NR=,A=</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
defines the radial mesh, together with R, on which
           densities and potentials are tabulated with MT sphere
           It is a shifted logarithmic radial mesh of points
           const*exp(A*(0..NR-1)-1).
</p>
</div>
</div>
<div id="outline-container-orga4d0a48" class="outline-4">
<h4 id="orga4d0a48"><span class="section-number-4">1.1.4</span> LMX=</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
basis l-cutoff inside the sphere.  If not specified,
           it defaults to NL-1.
</p>
</div>
</div>
<div id="outline-container-org618579b" class="outline-4">
<h4 id="org618579b"><span class="section-number-4">1.1.5</span> IDMOD=   (special option)</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
a set of integers, one for each l-channel controlling
           how the potential parameter enu changes from
           one iteration to the next in a self-consistency cycle.
           0:  lets the enu shift to the center of gravity
              of the occupied part of the band (this is the default);
           1:  freezes the logarithmic derivative of the
              wave function phi at the sphere radius from one iteration
              to the next;
           2:  freezes the enu's from one iteration to the next.
</p>
</div>
</div>
<div id="outline-container-org4bb156d" class="outline-4">
<h4 id="org4bb156d"><span class="section-number-4">1.1.6</span> IDU=, UH=, JH=</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
pecify parameters for LDA+U.  IDU=#,#,#,&#x2026; specifies which
          l-channels are to have U and the type of LDA+U implementation.
          0 in a particular l-channel means no U is to be applied
          1,2,3 are for particular forms of LDA+U.  However,
          at present the ASA code does not have a proper implementation of LDA+U;
          instead potential parameters C and enu may be shifted by a constant.
          Use IDU=4 to shift both spin channels by a constant (specified by U)
          or  IDU=5 to shift majority channel by U and minority by J.
          Example:
             IDU= 0 0 0 5 UH= 0 0 0 -0.28    JH=0 0 0 0.23
          shifts the majority f channel by -0.28 Ry and the minority f channel
          by 0.23 Ry.  This mimics an LDA+U calculation for Gd.
</p>
</div>
</div>

<div id="outline-container-orgcfdd85e" class="outline-4">
<h4 id="orgcfdd85e"><span class="section-number-4">1.1.7</span> P=real,real,&#x2026;.</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
Starting values for potential functions, one for each of l=0..LMXA (real numbers for s,p,d,f
Default: taken from an internal table.&#x2014;&gt; See by 'lmfa si|grep conf' for ctrl.si.
</p>
</div>
</div>
<div id="outline-container-org8a658df" class="outline-4">
<h4 id="org8a658df"><span class="section-number-4">1.1.8</span> PZ= real,real,&#x2026;</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
Starting values for local orbital's potential functions, one for each of l=0..LMX. Setting PZ=0 for any l means that no local orbital is specified for this l. Each integer part of PZ must be either one less than P (semicore state) or one greater (high-lying state).
Default: zero.
</p>
</div>
</div>

<div id="outline-container-org1e43458" class="outline-4">
<h4 id="org1e43458"><span class="section-number-4">1.1.9</span> Q= real,real,&#x2026;</h4>
<div class="outline-text-4" id="text-1-1-9">
<p>
charges for each l-channel making up free-atom density
Default: taken from an internal table.
</p>
</div>
</div>
<div id="outline-container-org5c05486" class="outline-4">
<h4 id="org5c05486"><span class="section-number-4">1.1.10</span> MMOM=real,real,&#x2026;</h4>
<div class="outline-text-4" id="text-1-1-10">
<p>
magnetic moments for each l-channel making up free-atom density Relevant only for the spin-polarized case.
Default: 0,0,&#x2026; 
</p>
</div>
</div>
<div id="outline-container-orgd7c75be" class="outline-4">
<h4 id="orgd7c75be"><span class="section-number-4">1.1.11</span> LFOCA</h4>
<div class="outline-text-4" id="text-1-1-11">
<p>
prescribes how core is treated.
    0 confines core to within RMT. Usually the least accurate. 
    1 treats the core as frozen but lets it spill into the interstitial 
    2 same as 1, but interstitial contribution to vxc treated perturbatively. 
Default: 1 
</p>
</div>
</div>
<div id="outline-container-org3002341" class="outline-4">
<h4 id="org3002341"><span class="section-number-4">1.1.12</span> LMXA</h4>
<div class="outline-text-4" id="text-1-1-12">
<p>
angular momentum l-cutoff for projection of wave functions tails centered at other sites in this sphere. Must be at least the basis l-cutoff (specified by LMX=).
Default:NL-1.
LMXA should be the same for all sites for QSGW (2019,because of implementation problem).
</p>
</div>
</div>

<div id="outline-container-org6be9f26" class="outline-4">
<h4 id="org6be9f26"><span class="section-number-4">1.1.13</span> C-HOLE</h4>
<div class="outline-text-4" id="text-1-1-13">
<p>
channel for core hole. You can force partial core occupation. Syntax consists of two characters, the principal quantum number and the second one of `s',`d',`d',`f' for the l quantum number, e.g. `2s' See Partially occupied core holes for description and examples.
Default: nothing 
</p>
</div>
</div>
<div id="outline-container-org4c2fff7" class="outline-4">
<h4 id="org4c2fff7"><span class="section-number-4">1.1.14</span> C-HQ= real[,real]</h4>
<div class="outline-text-4" id="text-1-1-14">
<p>
First number specifies the number of electrons to remove from the l channel specified by C-HOLE=.
Second (optional) number specifies the hole magnetic moment.
See Partially occupied core holes for description and examples. 
</p>
</div>
</div>
