Document/Manual/CategoryAndToken.org
*** KMXA
polynomial cutoff for projection of wave functions in sphere. Smoothed Hankels are expanded in polynomials around other sites instead of Bessel functions as in the case of normal Hankels.
Default:3
*** RSMA
smoothing radius for projection of smoothed Hankel tails into augmentation spheres. sm-Hankels are expanded in polynomials by integrating with Gaussians at that site. Thus RSMA=0 => sm-Hankels Taylor series expansion about the origin. For large KMXA the choice is irrelevant, but RSMA is best chosen that maximizes the convergence of sm-Hankels with KMXA.
Default: R*0.5, with R=augmentation (muffin-tin) radius. 
*** RSMG
smoothing radius for Gaussians added to sphere densities to correct multipole moments needed for electrostatics. Value should be as large as possible 
but small enough that the Gaussian doesn't spill out significantly beyond rmt.
Default: R/4, with R=augmentation (muffin-tin) radius. 
*** LMXL (obsolate?)
angular momentum l-cutoff for explicit representation of local charge on a radial mesh.
Default:NL-1 
*** RFOCA
smoothing radius fitting tails of core density. A large radius produces smoother interstitial charge, but less accurate fit.
Default: R*0.4, with R=augmentation (muffin-tin) radius. 
*** RSMFA
smoothing radius for tails of free-atom charge density. Irrelevant except first iteration only (non-self-consistent harris). A large radius produces smoother interstitial charge, but somewhat less accurate fit.
Default: R/2, with R=augmentation (muffin-tin) radius. 

* SYMGRP
Category SYMGRP provides symmetry information; it helps in two
ways.  First it is the relevant information to find which sites
are equivalent, which makes for simpler and more accurate band
calculations, and second, it reduces the number of k-points
needed in Brillouin zone integrations.

Unless you are doing something special, normally you don't need
SYMGRP; the program is capable of finding its own symmetry
operations.  However, if you want to restrict operations to a set
you specify, or if you are doing something (like noncollinear
magnetism) where the symmetry group isn't specified by atomic
positions along, use SYMGRP to explicitly declare a set of
generators from which the entire group can be created.  For
example, the three operations R4X, MX and R3D are sufficient to
generate all 48 elements of cubic symmetry (the inversion is
always assumed).

A symbol describing a generator for a point group operation has
the form O(nx,ny,nz) where O is one of M, I or Rj for mirror,
inversion and j-fold rotation; and nx,ny,nz are a triplet of
indices specifying the axis of operation.  You may use X, Y, Z or
D as shorthand for (1,0,0), (0,1,0), (0,0,1), (1,1,1).  You may
also enter products, such as I*R4X.  Example:
  SYMGRP  R4X MX R3D
specifies three generators (4-fold rotation around x, mirror in
x, 3-fold rotation around (1,1,1)) and will result in 48 symmetry
operations.

To suppress all symmetry operations, use
  SYMGRP i*i

The keyword `find' tells the program to determine its own
symmetry operations.  Thus
  SYMGRP find
is amounts to the same as not including a SYMGRP category
in the input at all.

You can also specify a mix of generators you supply, and
tell the program to find any others that might exist.
For example,
  SYMGRP r4x find
specifies that 4-fold symop be included, and `find' tells
the program to look for any other symops that might exist.

Full-potential implementations require you to specify the full
space group operation.  This you do by appending a string of the
form `:(x1,x2,x3)' to the point group operation, or an alternate
form `::(p1,p2,p3)' with the double `::'.  The first defines the
translation in Cartesian coordinates; the second as multiples of
plat.  These two lines taken from testing/ctrl.cr3si6 are
equivalent specifications
  SYMGRP   r6z:(0,0,0.4778973) r2(1/2,sqrt(3)/2,0)
  SYMGRP   r6z::(0,0,1/3)      r2(1/2,sqrt(3)/2,0)

* BZ
 Category BZ holds information concerning the numerical
 integration of energy bands over the Brillouin Zone.  The LMTO
 programs are not tied to any one method, so the desired method
 must be specified by a token.  Unless a table of k-points is
 supplied and the GETQP switch is set, the program will divide
 the BZ into a uniform mesh of points by making NKABC divisions
 along the primitive reciprocal cell vectors.


** NKABC=  (1-3 integers) 
   the number of divisions in the three
          directions of the reciprocal lattice vectors.  The
          number of k-points in the full BZ is the product of
          these numbers, this may be reduced by symmetry
          operations.  Alternatively, you may specify k-points
          explicitly in a separate file, as the following shows:

**  TETRA= 
   selects BZ integration method
          0: Methfessel-Paxton sampling integration
             Tokens NPTS, N, W, EF0, DELEF described below are
             relevant to this integration scheme.
          1: tetrahedron integration

  W=      Line broadening for Gaussian sampling integration (Ry).
          Used only if TETRA=0 and MET>0.
          NB: if N=-1 below, the sampling weights are computed
          from the Fermi function instead of the error function.
          In that case, token W= corresponds to temperature, in Ry.

  N=      If N=#, #>0: integration uses generalized gaussian
          functions, i.e. polynomial of order N * gaussian to
          generate integration weights
          (see Methfessel & Paxton, Phys. Rev. B, 40, 3616 (1989))

          If N=#, #<0: integration uses the Fermi function to
          generate integration weights .

          By default, if a gap is found separating occupied and
          occupied states, the program will treat the system as
          and insulator, even when MET>0.  To suppress this,
          add 100(-100 for Fermi distribution) to N.

          Used only if TETRA=0 and MET>0.

**  SAVDOS=  
   0: does not save dos on disk

   1: writes the total density of states on NPTS mesh
            points to disk file `dos'.

   2: Write weights to disk for partial DOS
            (In the ASA, with METAL=t this occurs anyway)

   4: Same as option (2), but write weights m-resolved.
            You may also cause lm to generate m-resolved dos using
            the --pdos command-line argument.
            NB: you must turn OFF all symmetry operations to produce
            correct results.  (The extra inversion symmetry in the
            k-points from time-reversal symmetry is still allowed.)
          Note: SAVDOS>0 requires NPTS and DOS also.

**  NPT=   number of points in the density-of-states mesh used in
          conjunction with sampling integration.  Needed for
          sampling or if SAVDOS>0.

