Document/Manual/CategoryAndToken.html

<div id="outline-container-orga4a596e" class="outline-4">
<h4 id="orga4a596e"><span class="section-number-4">1.1.15</span> KMXA</h4>
<div class="outline-text-4" id="text-1-1-15">
<p>
polynomial cutoff for projection of wave functions in sphere. Smoothed Hankels are expanded in polynomials around other sites instead of Bessel functions as in the case of normal Hankels.
Default:3
</p>
</div>
</div>
<div id="outline-container-orgdef3203" class="outline-4">
<h4 id="orgdef3203"><span class="section-number-4">1.1.16</span> RSMA</h4>
<div class="outline-text-4" id="text-1-1-16">
<p>
smoothing radius for projection of smoothed Hankel tails into augmentation spheres. sm-Hankels are expanded in polynomials by integrating with Gaussians at that site. Thus RSMA=0 =&gt; sm-Hankels Taylor series expansion about the origin. For large KMXA the choice is irrelevant, but RSMA is best chosen that maximizes the convergence of sm-Hankels with KMXA.
Default: R*0.5, with R=augmentation (muffin-tin) radius. 
</p>
</div>
</div>
<div id="outline-container-org483424c" class="outline-4">
<h4 id="org483424c"><span class="section-number-4">1.1.17</span> RSMG</h4>
<div class="outline-text-4" id="text-1-1-17">
<p>
smoothing radius for Gaussians added to sphere densities to correct multipole moments needed for electrostatics. Value should be as large as possible 
but small enough that the Gaussian doesn't spill out significantly beyond rmt.
Default: R/4, with R=augmentation (muffin-tin) radius. 
</p>
</div>
</div>
<div id="outline-container-orgece06c4" class="outline-4">
<h4 id="orgece06c4"><span class="section-number-4">1.1.18</span> LMXL (obsolate?)</h4>
<div class="outline-text-4" id="text-1-1-18">
<p>
angular momentum l-cutoff for explicit representation of local charge on a radial mesh.
Default:NL-1 
</p>
</div>
</div>
<div id="outline-container-org65eb810" class="outline-4">
<h4 id="org65eb810"><span class="section-number-4">1.1.19</span> RFOCA</h4>
<div class="outline-text-4" id="text-1-1-19">
<p>
smoothing radius fitting tails of core density. A large radius produces smoother interstitial charge, but less accurate fit.
Default: R*0.4, with R=augmentation (muffin-tin) radius. 
</p>
</div>
</div>
<div id="outline-container-orge6e72d3" class="outline-4">
<h4 id="orge6e72d3"><span class="section-number-4">1.1.20</span> RSMFA</h4>
<div class="outline-text-4" id="text-1-1-20">
<p>
smoothing radius for tails of free-atom charge density. Irrelevant except first iteration only (non-self-consistent harris). A large radius produces smoother interstitial charge, but somewhat less accurate fit.
Default: R/2, with R=augmentation (muffin-tin) radius. 
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org369364d" class="outline-2">
<h2 id="org369364d"><span class="section-number-2">2</span> SYMGRP</h2>
<div class="outline-text-2" id="text-2">
<p>
Category SYMGRP provides symmetry information; it helps in two
ways.  First it is the relevant information to find which sites
are equivalent, which makes for simpler and more accurate band
calculations, and second, it reduces the number of k-points
needed in Brillouin zone integrations.
</p>

<p>
Unless you are doing something special, normally you don't need
SYMGRP; the program is capable of finding its own symmetry
operations.  However, if you want to restrict operations to a set
you specify, or if you are doing something (like noncollinear
magnetism) where the symmetry group isn't specified by atomic
positions along, use SYMGRP to explicitly declare a set of
generators from which the entire group can be created.  For
example, the three operations R4X, MX and R3D are sufficient to
generate all 48 elements of cubic symmetry (the inversion is
always assumed).
</p>

<p>
A symbol describing a generator for a point group operation has
the form O(nx,ny,nz) where O is one of M, I or Rj for mirror,
inversion and j-fold rotation; and nx,ny,nz are a triplet of
indices specifying the axis of operation.  You may use X, Y, Z or
D as shorthand for (1,0,0), (0,1,0), (0,0,1), (1,1,1).  You may
also enter products, such as I*R4X.  Example:
  SYMGRP  R4X MX R3D
specifies three generators (4-fold rotation around x, mirror in
x, 3-fold rotation around (1,1,1)) and will result in 48 symmetry
operations.
</p>

<p>
To suppress all symmetry operations, use
  SYMGRP i*i
</p>

<p>
The keyword `find' tells the program to determine its own
symmetry operations.  Thus
  SYMGRP find
is amounts to the same as not including a SYMGRP category
in the input at all.
</p>

<p>
You can also specify a mix of generators you supply, and
tell the program to find any others that might exist.
For example,
  SYMGRP r4x find
specifies that 4-fold symop be included, and `find' tells
the program to look for any other symops that might exist.
</p>

<p>
Full-potential implementations require you to specify the full
space group operation.  This you do by appending a string of the
form `:(x1,x2,x3)' to the point group operation, or an alternate
form `::(p1,p2,p3)' with the double `::'.  The first defines the
translation in Cartesian coordinates; the second as multiples of
plat.  These two lines taken from testing/ctrl.cr3si6 are
equivalent specifications
  SYMGRP   r6z:(0,0,0.4778973) r2(1/2,sqrt(3)/2,0)
  SYMGRP   r6z::(0,0,1/3)      r2(1/2,sqrt(3)/2,0)
</p>
</div>
</div>

<div id="outline-container-org10e2aeb" class="outline-2">
<h2 id="org10e2aeb"><span class="section-number-2">3</span> BZ</h2>
<div class="outline-text-2" id="text-3">
<p>
Category BZ holds information concerning the numerical
integration of energy bands over the Brillouin Zone.  The LMTO
programs are not tied to any one method, so the desired method
must be specified by a token.  Unless a table of k-points is
supplied and the GETQP switch is set, the program will divide
the BZ into a uniform mesh of points by making NKABC divisions
along the primitive reciprocal cell vectors.
</p>
</div>


<div id="outline-container-org2e99a55" class="outline-3">
<h3 id="org2e99a55"><span class="section-number-3">3.1</span> NKABC=  (1-3 integers)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
the number of divisions in the three
       directions of the reciprocal lattice vectors.  The
       number of k-points in the full BZ is the product of
       these numbers, this may be reduced by symmetry
       operations.  Alternatively, you may specify k-points
       explicitly in a separate file, as the following shows:
</p>
</div>
</div>

<div id="outline-container-orga12204e" class="outline-3">
<h3 id="orga12204e"><span class="section-number-3">3.2</span> TETRA=</h3>
<div class="outline-text-3" id="text-3-2">
<p>
selects BZ integration method
       0: Methfessel-Paxton sampling integration
	  Tokens NPTS, N, W, EF0, DELEF described below are
	  relevant to this integration scheme.
       1: tetrahedron integration
</p>

<p>
W=      Line broadening for Gaussian sampling integration (Ry).
	Used only if TETRA=0 and MET&gt;0.
	NB: if N=-1 below, the sampling weights are computed
	from the Fermi function instead of the error function.
	In that case, token W= corresponds to temperature, in Ry.
</p>

<p>
N=      If N=#, #&gt;0: integration uses generalized gaussian
	functions, i.e. polynomial of order N * gaussian to
	generate integration weights
	(see Methfessel &amp; Paxton, Phys. Rev. B, 40, 3616 (1989))
</p>

<p>
If N=#, #&lt;0: integration uses the Fermi function to
generate integration weights .
</p>

<p>
By default, if a gap is found separating occupied and
occupied states, the program will treat the system as
and insulator, even when MET&gt;0.  To suppress this,
add 100(-100 for Fermi distribution) to N.
</p>

<p>
Used only if TETRA=0 and MET&gt;0.
</p>
</div>
</div>

<div id="outline-container-org3126538" class="outline-3">
<h3 id="org3126538"><span class="section-number-3">3.3</span> SAVDOS=</h3>
<div class="outline-text-3" id="text-3-3">
<p>
0: does not save dos on disk
</p>

<p>
1: writes the total density of states on NPTS mesh
	 points to disk file `dos'.
</p>

<p>
2: Write weights to disk for partial DOS
	 (In the ASA, with METAL=t this occurs anyway)
</p>

<p>
4: Same as option (2), but write weights m-resolved.
	 You may also cause lm to generate m-resolved dos using
	 the &#x2013;pdos command-line argument.
	 NB: you must turn OFF all symmetry operations to produce
	 correct results.  (The extra inversion symmetry in the
	 k-points from time-reversal symmetry is still allowed.)
       Note: SAVDOS&gt;0 requires NPTS and DOS also.
</p>
</div>
</div>

<div id="outline-container-orgd90ce1e" class="outline-3">
<h3 id="orgd90ce1e"><span class="section-number-3">3.4</span> NPT=   number of points in the density-of-states mesh used in</h3>
<div class="outline-text-3" id="text-3-4">
<p>
conjunction with sampling integration.  Needed for
sampling or if SAVDOS&gt;0.
</p>
</div>
</div>
