Document/Manual/CategoryAndToken.org
**  DOS=    (two numbers) Energy window over which DOS accumulated.
          Needed for sampling or if SAVDOS>0.

**  METAL= 4 
    (old document)
     specifies how the weights are generated for BZ
          integration.  There is a difficulty in that EITHER the
          weights must be known in advance before looping over
          k-points, in order accumulate the output density, OR
          the eigenvectors for each k-point must be kept until
          the Fermi level is determined.  When just accumulating
          the spherical part of the charge, as in the the ASA,
          the eigenvector information can be contracted over m,
          and is not prohibitive, but the situation is rather
          worse in general.  There are several ways out of this
          difficulty:

          METAL=0 system assumed to be an insulator; weights
                  known a priori

          METAL=2 integration weights are read from file `wkp',
                  which was generated in a prior band pass (if
                  file is missing, program will temporarily
                  switch to mode METAL=3:)

          METAL=3 two band passes are made; the first generates
                  only eigenvalues and the Fermi level is
                  determined.

          METAL=4 weights and related information is retained for
                  three distinct Fermi levels.  After the Fermi
                  level is determined, the density is obtained by
                  quadratic interpolation through the three
                  points.  (This scheme is suitable for sampling
                  only, since in that case just the Fermi level
                  is needed to set integration weights.  When
                  this scheme is used in conjunction with the
                  tetrahedron method, the charge density is
                  calculated with sampling.

**  NEVMX=  nevmx>0 : Find at most nevmx eigenvectors;
          nevmx=0 : program uses internal default
          nevmx<0 : no eigenvectors are generated (and
                    correspondingly, nothing associated with
                    eigenvectors such as density.)

          Caution: if you want to look and partial DOS well above
          the Fermi level (which comes out around 0), you must
          set EFMAX and NEVMX high enough to encompass the range
          of interest.

**  ZVAL=   Number of electrons to accumulate in BZ integration.
          Normally zval is computed by the program.

**  NOINV=  suppress the automatic addition of the inversion to the
          list of point group operations.  Usually addition of
          inversion is allowed because of time reversal symmetry.
          There are some cases, where this symmetry is broken,
          such as when spin-orbit coupling is included.  The
          program will automatically disable this addition in
          cases that knows the symmetry is broken.

**  FSMOM=  set the global magnetic moment (collinear magnetic case).
          In the fixed-spin moment method, a spin-dependent potential
          shift is added to constrain the total magnetic moment to
          value assigned by FSMOM=.  No constraint is imposed if this
          value is zero (the default).
          Notes:
          1. At present there is ba term missing in the HF
             energy, so it should not be used.
          2. an iterative scheme is used to determine the potential
             and it not foolproof.

**  INVIT=  enables inverse iteration generate eigenvectors (this is
          the default). It is more efficient than the QL method,
          but occasionally fails to find all the vectors.  When
          this happens, the program stops with the message:
             DIAGNO: tinvit cannot find all evecs
          If you encounter this message set INVIT=F.


* EWALD
 Category EWALD holds information controlling the Ewald sums for
 structure constants entering into, e.g. the Madelung summations.
 The defaults are usually adequate; for a detailed description
 the reader is referred to documentation on the Madelung sums.

**  NKDMX=  the maximum number of real-space lattice vectors
          entering into the Ewald sum, used for memory allocation.
          Normally you should not need this token.  Increase
          NKDMX if you encounter an error message like
             xlgen: too many vectors, n=...

**  AS=     controls the relative number of lattice vectors in real
          and reciprocal space.

** TOL=    error criterion for the Ewald sums.


* HAM
** GMAX
an energy cutoff used to create mesh for the interstitial density. 
A uniform mesh is created that best `fits into' cutoff gmax.

** FTMESH
he number of divisions specifying the uniform mesh 
density along the three reciprocal lattice vectors. The second and third arguments default to the value of the first one, if they are not specified. Required input; alternatively information may be specified by the preceding token..
** TOL
specifies the precision to which the wave functions are expanded in a Fourier expansion.
Default:10E-6

** FRZWF (=T or F)
specifies whether the augmented part of the wave functions be frozen. Normally they are updated as the potential changes, but with FRZWF=t the potential used to make augmentation wave functions is frozen at what is read from the restart file (or free-atom potential if starting from superposing free atoms).
Default:F

** FORCES (=0 or 1)
controls how forces are to be calculated, and how the second-order corrections are to be evaluated. Through the variational principle, the total energy is correct to second order in deviations from self-consistency, but forces are correct only to first order. To obtain forces to second order, it is necessary to know how the density would change with a (virtual) displacement of the core+nucleus, which requires a linear response treatment. lmf estimates this changes in one of two ways:
    the free-atom density is subtracted from the total density for nuclei centered at the original position and added back again at the (virtually) displaced position.
    For this ansatz, use FORCES=1.
    the core+nucleus is shifted and screened assuming a Lindhard dielectric response.
    For this ansatz, use FORCES=12. You also must specify ELIND, below. 

