Document/Manual/CategoryAndToken.html

<div id="outline-container-orgd8bb590" class="outline-3">
<h3 id="orgd8bb590"><span class="section-number-3">3.5</span> DOS=    (two numbers) Energy window over which DOS accumulated.</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Needed for sampling or if SAVDOS&gt;0.
</p>
</div>
</div>

<div id="outline-container-org9784a79" class="outline-3">
<h3 id="org9784a79"><span class="section-number-3">3.6</span> METAL= 4</h3>
<div class="outline-text-3" id="text-3-6">
<p>
(old document)
 specifies how the weights are generated for BZ
      integration.  There is a difficulty in that EITHER the
      weights must be known in advance before looping over
      k-points, in order accumulate the output density, OR
      the eigenvectors for each k-point must be kept until
      the Fermi level is determined.  When just accumulating
      the spherical part of the charge, as in the the ASA,
      the eigenvector information can be contracted over m,
      and is not prohibitive, but the situation is rather
      worse in general.  There are several ways out of this
      difficulty:
</p>

<p>
METAL=0 system assumed to be an insulator; weights
	known a priori
</p>

<p>
METAL=2 integration weights are read from file `wkp',
	which was generated in a prior band pass (if
	file is missing, program will temporarily
	switch to mode METAL=3:)
</p>

<p>
METAL=3 two band passes are made; the first generates
	only eigenvalues and the Fermi level is
	determined.
</p>

<p>
METAL=4 weights and related information is retained for
	three distinct Fermi levels.  After the Fermi
	level is determined, the density is obtained by
	quadratic interpolation through the three
	points.  (This scheme is suitable for sampling
	only, since in that case just the Fermi level
	is needed to set integration weights.  When
	this scheme is used in conjunction with the
	tetrahedron method, the charge density is
	calculated with sampling.
</p>
</div>
</div>

<div id="outline-container-org043ccce" class="outline-3">
<h3 id="org043ccce"><span class="section-number-3">3.7</span> NEVMX=  nevmx&gt;0 : Find at most nevmx eigenvectors;</h3>
<div class="outline-text-3" id="text-3-7">
<p>
nevmx=0 : program uses internal default
nevmx&lt;0 : no eigenvectors are generated (and
	  correspondingly, nothing associated with
	  eigenvectors such as density.)
</p>

<p>
Caution: if you want to look and partial DOS well above
the Fermi level (which comes out around 0), you must
set EFMAX and NEVMX high enough to encompass the range
of interest.
</p>
</div>
</div>

<div id="outline-container-org492df97" class="outline-3">
<h3 id="org492df97"><span class="section-number-3">3.8</span> ZVAL=   Number of electrons to accumulate in BZ integration.</h3>
<div class="outline-text-3" id="text-3-8">
<p>
Normally zval is computed by the program.
</p>
</div>
</div>

<div id="outline-container-orgec12d27" class="outline-3">
<h3 id="orgec12d27"><span class="section-number-3">3.9</span> NOINV=  suppress the automatic addition of the inversion to the</h3>
<div class="outline-text-3" id="text-3-9">
<p>
list of point group operations.  Usually addition of
inversion is allowed because of time reversal symmetry.
There are some cases, where this symmetry is broken,
such as when spin-orbit coupling is included.  The
program will automatically disable this addition in
cases that knows the symmetry is broken.
</p>
</div>
</div>

<div id="outline-container-org6beb190" class="outline-3">
<h3 id="org6beb190"><span class="section-number-3">3.10</span> FSMOM=  set the global magnetic moment (collinear magnetic case).</h3>
<div class="outline-text-3" id="text-3-10">
<p>
In the fixed-spin moment method, a spin-dependent potential
shift is added to constrain the total magnetic moment to
value assigned by FSMOM=.  No constraint is imposed if this
value is zero (the default).
Notes:
</p>
<ol class="org-ol">
<li>At present there is ba term missing in the HF
energy, so it should not be used.</li>
<li>an iterative scheme is used to determine the potential
and it not foolproof.</li>
</ol>
</div>
</div>

<div id="outline-container-org9cd419e" class="outline-3">
<h3 id="org9cd419e"><span class="section-number-3">3.11</span> INVIT=  enables inverse iteration generate eigenvectors (this is</h3>
<div class="outline-text-3" id="text-3-11">
<p>
the default). It is more efficient than the QL method,
but occasionally fails to find all the vectors.  When
this happens, the program stops with the message:
   DIAGNO: tinvit cannot find all evecs
If you encounter this message set INVIT=F.
</p>
</div>
</div>
</div>


<div id="outline-container-org494b81a" class="outline-2">
<h2 id="org494b81a"><span class="section-number-2">4</span> EWALD</h2>
<div class="outline-text-2" id="text-4">
<p>
Category EWALD holds information controlling the Ewald sums for
structure constants entering into, e.g. the Madelung summations.
The defaults are usually adequate; for a detailed description
the reader is referred to documentation on the Madelung sums.
</p>
</div>

<div id="outline-container-org011f119" class="outline-3">
<h3 id="org011f119"><span class="section-number-3">4.1</span> NKDMX=  the maximum number of real-space lattice vectors</h3>
<div class="outline-text-3" id="text-4-1">
<p>
entering into the Ewald sum, used for memory allocation.
Normally you should not need this token.  Increase
NKDMX if you encounter an error message like
   xlgen: too many vectors, n=&#x2026;
</p>
</div>
</div>

<div id="outline-container-org196ba11" class="outline-3">
<h3 id="org196ba11"><span class="section-number-3">4.2</span> AS=     controls the relative number of lattice vectors in real</h3>
<div class="outline-text-3" id="text-4-2">
<p>
and reciprocal space.
</p>
</div>
</div>

<div id="outline-container-org91dcdb1" class="outline-3">
<h3 id="org91dcdb1"><span class="section-number-3">4.3</span> TOL=    error criterion for the Ewald sums.</h3>
</div>
</div>


<div id="outline-container-org35addb1" class="outline-2">
<h2 id="org35addb1"><span class="section-number-2">5</span> HAM</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org9385b65" class="outline-3">
<h3 id="org9385b65"><span class="section-number-3">5.1</span> GMAX</h3>
<div class="outline-text-3" id="text-5-1">
<p>
an energy cutoff used to create mesh for the interstitial density. 
A uniform mesh is created that best `fits into' cutoff gmax.
</p>
</div>
</div>

<div id="outline-container-org598e5e8" class="outline-3">
<h3 id="org598e5e8"><span class="section-number-3">5.2</span> FTMESH</h3>
<div class="outline-text-3" id="text-5-2">
<p>
he number of divisions specifying the uniform mesh 
density along the three reciprocal lattice vectors. The second and third arguments default to the value of the first one, if they are not specified. Required input; alternatively information may be specified by the preceding token..
</p>
</div>
</div>
<div id="outline-container-org3bc7ec8" class="outline-3">
<h3 id="org3bc7ec8"><span class="section-number-3">5.3</span> TOL</h3>
<div class="outline-text-3" id="text-5-3">
<p>
specifies the precision to which the wave functions are expanded in a Fourier expansion.
Default:10E-6
</p>
</div>
</div>

<div id="outline-container-orga3c125e" class="outline-3">
<h3 id="orga3c125e"><span class="section-number-3">5.4</span> FRZWF (=T or F)</h3>
<div class="outline-text-3" id="text-5-4">
<p>
specifies whether the augmented part of the wave functions be frozen. Normally they are updated as the potential changes, but with FRZWF=t the potential used to make augmentation wave functions is frozen at what is read from the restart file (or free-atom potential if starting from superposing free atoms).
Default:F
</p>
</div>
</div>

<div id="outline-container-orgf27ea60" class="outline-3">
<h3 id="orgf27ea60"><span class="section-number-3">5.5</span> FORCES (=0 or 1)</h3>
<div class="outline-text-3" id="text-5-5">
<p>
controls how forces are to be calculated, and how the second-order corrections are to be evaluated. Through the variational principle, the total energy is correct to second order in deviations from self-consistency, but forces are correct only to first order. To obtain forces to second order, it is necessary to know how the density would change with a (virtual) displacement of the core+nucleus, which requires a linear response treatment. lmf estimates this changes in one of two ways:
    the free-atom density is subtracted from the total density for nuclei centered at the original position and added back again at the (virtually) displaced position.
    For this ansatz, use FORCES=1.
    the core+nucleus is shifted and screened assuming a Lindhard dielectric response.
    For this ansatz, use FORCES=12. You also must specify ELIND, below. 
</p>
</div>
</div>
