Document/Manual/CategoryAndToken.org
** ELIND (Default=-1)
a parameter in the the Lindhard response function, namely the Fermi level for a free-electron gas relative to the bottom of the band. You can specify this energy directly, by using a positive number for the parameter. If you use instead a negative number, the program will choose a default value from the total number of valence electrons and assuming a free-electron gas, scale that default by the absolute value of the number you specify. If you have a simple sp bonded system, the default value is an excellent choice. If you have d or f electrons, it tends to overestimate the response. Use a something smaller, e.g. ELIND=-0.7. ELIND is used in three contexts:
    (1) in the force correction term; see FORCES= above 
    (2) to estimate a self-consistent density from the input and output densities after a band pass 
    (3) to estimate a reasonable smooth density from a starting density after atoms are moved in a relaxation step. 

Default:-1

* ITER
** MIX 

Example: MIX=A2,b=.3,n=3

---follwings still may have some inconsistency ---

Category MIX controls the mixing scheme used in the iterations
 towards self-consistency.  There is a choice
 between the Broyden and Anderson mixing schemes. 
 Both schemes
 mix in linear combinations of the input and output density
 both from the present iteration and prior
 iterations to accelerate convergence to self-consistency (output
 = input).  For Anderson mixing, the mixing beta controls how
 much output and how much input moment is used in the next
 estimate such as: Q* = beta*Qout + (1-beta)*Qin.  Here
 Qout and Qin are charges, and
 the "charges" generated by the input "charge" for a sequence of
 prior iterations.  For small systems, you can take beta close to
 one; for large systems charge sloshing becomes a problem and you
 have to do something different.  Possible choices need to take
 beta much smaller.  See slatsm/amix.f for a description of the
 Anderson mixing scheme, and how it chooses the linear
 combination of prior iterations in the mix.

 The syntax for Anderson mixing is

   MIX=A[nmix][,b=beta][,n=nit]

 where the optional b=val assigns val to beta.

 Broyden mixing uses a more sophisticated procedure, in which it
 tries to build up the Hessian matrix.  It usually works better
 but has more pitfalls than Anderson.  As with Anderson, it uses
 linear mixing in the absence of prior iterations, Q* = beta*Qout
 + (1-beta)*Qin.  Broyden has an additional parameter, wc, that
 controls how much weight is given to prior iterations in the mix
 (see below).  The syntax for Broyden mixing is

   MODE=B[nmix][,b=beta][,n=nit]

 These parameters are as follows.  Fortran routine parmxp.f parses
 the MODE line to read the parameters, and pqmix.f does
 the mixing.

   nmix: maximum number of prior iterations to include in the mix
         (the mixing file may contain more than nmix prior
         iterations.)  NB: nmix=0 implies linear mixing.

   beta: the mixing beta (see above)

   nit:  the number of iterations to use mix with this set of
         parameters before passing on to the next set. After the
         last set is exhausted, it starts over with the first
         set.
** CONV
maximum allowed change in energy between iterations to reach self-consistency. 
Search diffe in concole output.

** CONVC
maximum allowed change in output-input density to reach self-consistency. 

** NIT 
maximum number of iteration 
* DYN 
is used for atomic position relaxiation.
(no automatic cell relaxiation yet). Only at LDA/GGA level.
** MSTAT
Sample: MSTAT[MODE=5 HESS=T XTOL=.001 GTOL=0 STEP=.015]
a collection of parameters specifying how site positions are relaxed given the internuclear forces

 MODE
   =0: skip relaxation of atom positions
    4: relax using conjugate-gradients
    5: relax using Fletcher-Powell
    6: relax using Broyden

 HESS
     T: read hessian from disk
    F: assume initial hessian=1

 XTOL convergence criterion in displacements
    r3=0 means not to use this criterion

 GTOL convergence criterion in forces
    r4=0 means not to use this criterion
    NOTE: you should have either r3>0 or r4>0

 STEP initial step length, in units of the lattice parameter a

Default: no relaxation 

** NIT
maximum number of relaxation steps 
