Document/Manual/CategoryAndToken.html

<div id="outline-container-org9dd1436" class="outline-3">
<h3 id="org9dd1436"><span class="section-number-3">5.6</span> ELIND (Default=-1)</h3>
<div class="outline-text-3" id="text-5-6">
<p>
a parameter in the the Lindhard response function, namely the Fermi level for a free-electron gas relative to the bottom of the band. You can specify this energy directly, by using a positive number for the parameter. If you use instead a negative number, the program will choose a default value from the total number of valence electrons and assuming a free-electron gas, scale that default by the absolute value of the number you specify. If you have a simple sp bonded system, the default value is an excellent choice. If you have d or f electrons, it tends to overestimate the response. Use a something smaller, e.g. ELIND=-0.7. ELIND is used in three contexts:
    (1) in the force correction term; see FORCES= above 
    (2) to estimate a self-consistent density from the input and output densities after a band pass 
    (3) to estimate a reasonable smooth density from a starting density after atoms are moved in a relaxation step. 
</p>

<p>
Default:-1
</p>
</div>
</div>
</div>

<div id="outline-container-orga802d8c" class="outline-2">
<h2 id="orga802d8c"><span class="section-number-2">6</span> ITERa</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org29ee64e" class="outline-3">
<h3 id="org29ee64e"><span class="section-number-3">6.1</span> MIX</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Example: MIX=A2,b=.3,n=3
</p>

<p>
&#x2014;follwings still may have some inconsistency &#x2014;
</p>

<p>
Category MIX controls the mixing scheme used in the iterations
 towards self-consistency.  There is a choice
 between the Broyden and Anderson mixing schemes. 
 Both schemes
 mix in linear combinations of the input and output density
 both from the present iteration and prior
 iterations to accelerate convergence to self-consistency (output
 = input).  For Anderson mixing, the mixing beta controls how
 much output and how much input moment is used in the next
 estimate such as: Q* = beta*Qout + (1-beta)*Qin.  Here
 Qout and Qin are charges, and
 the "charges" generated by the input "charge" for a sequence of
 prior iterations.  For small systems, you can take beta close to
 one; for large systems charge sloshing becomes a problem and you
 have to do something different.  Possible choices need to take
 beta much smaller.  See slatsm/amix.f for a description of the
 Anderson mixing scheme, and how it chooses the linear
 combination of prior iterations in the mix.
</p>

<p>
The syntax for Anderson mixing is
</p>

<p>
MIX=A[nmix][,b=beta][,n=nit]
</p>

<p>
where the optional b=val assigns val to beta.
</p>

<p>
Broyden mixing uses a more sophisticated procedure, in which it
tries to build up the Hessian matrix.  It usually works better
but has more pitfalls than Anderson.  As with Anderson, it uses
linear mixing in the absence of prior iterations, Q* = beta*Qout
</p>
<ul class="org-ul">
<li>(1-beta)*Qin.  Broyden has an additional parameter, wc, that</li>
</ul>
<p>
controls how much weight is given to prior iterations in the mix
(see below).  The syntax for Broyden mixing is
</p>

<p>
MODE=B[nmix][,b=beta][,n=nit]
</p>

<p>
These parameters are as follows.  Fortran routine parmxp.f parses
the MODE line to read the parameters, and pqmix.f does
the mixing.
</p>

<p>
nmix: maximum number of prior iterations to include in the mix
      (the mixing file may contain more than nmix prior
      iterations.)  NB: nmix=0 implies linear mixing.
</p>

<p>
beta: the mixing beta (see above)
</p>

<p>
nit:  the number of iterations to use mix with this set of
      parameters before passing on to the next set. After the
      last set is exhausted, it starts over with the first
      set.
</p>
</div>
</div>
<div id="outline-container-org7d596c2" class="outline-3">
<h3 id="org7d596c2"><span class="section-number-3">6.2</span> CONV</h3>
<div class="outline-text-3" id="text-6-2">
<p>
maximum allowed change in energy between iterations to reach self-consistency. 
Search diffe in concole output.
</p>
</div>
</div>

<div id="outline-container-org326bd56" class="outline-3">
<h3 id="org326bd56"><span class="section-number-3">6.3</span> CONVC</h3>
<div class="outline-text-3" id="text-6-3">
<p>
maximum allowed change in output-input density to reach self-consistency. 
</p>
</div>
</div>

<div id="outline-container-org87a3b4a" class="outline-3">
<h3 id="org87a3b4a"><span class="section-number-3">6.4</span> NIT</h3>
<div class="outline-text-3" id="text-6-4">
<p>
maximum number of iteration 
</p>
</div>
</div>
</div>
<div id="outline-container-org33ea36d" class="outline-2">
<h2 id="org33ea36d"><span class="section-number-2">7</span> DYN</h2>
<div class="outline-text-2" id="text-7">
<p>
is used for atomic position relaxiation.
(no automatic cell relaxiation yet). Only at LDA/GGA level.
</p>
</div>
<div id="outline-container-orgcbde9f3" class="outline-3">
<h3 id="orgcbde9f3"><span class="section-number-3">7.1</span> MSTAT</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Sample: MSTAT[MODE=5 HESS=T XTOL=.001 GTOL=0 STEP=.015]
a collection of parameters specifying how site positions are relaxed given the internuclear forces
</p>

<p>
MODE
  =0: skip relaxation of atom positions
   4: relax using conjugate-gradients
   5: relax using Fletcher-Powell
   6: relax using Broyden
</p>

<p>
HESS
    T: read hessian from disk
   F: assume initial hessian=1
</p>

<p>
XTOL convergence criterion in displacements
   r3=0 means not to use this criterion
</p>

<p>
GTOL convergence criterion in forces
   r4=0 means not to use this criterion
   NOTE: you should have either r3&gt;0 or r4&gt;0
</p>

<p>
STEP initial step length, in units of the lattice parameter a
</p>

<p>
Default: no relaxation 
</p>
</div>
</div>

<div id="outline-container-orgff8f765" class="outline-3">
<h3 id="orgff8f765"><span class="section-number-3">7.2</span> NIT</h3>
<div class="outline-text-3" id="text-7-2">
<p>
maximum number of relaxation steps 
</p>
</div>
</div>
</div>

<div id="outline-container-orgb108822" class="outline-2">
<h2 id="orgb108822"><span class="section-number-2">8</span> STRUC</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: takao kotani @ tottori university, Japan</p>
<p class="date">Created: 2019-09-09 月 18:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
